package olga.fedianina.people.base;

//Я бы переименовал в SchoolGrades, т.к. ты перечисляешь классы, а не сами предметы
public enum Subject {
    //а вот предметы можно вынести в отдельный enum, чтобы меньше работать со строками (далее в коду возникают мапы с непонятными строками, 
    //где совершенно не очевидно их предназначение). Также отпадет необходимость в массиве для учителей и будет меньше шанс накосячить при переписывании строк.
    SUBJECT_1(new String[]{"Математика", "Русский язык", "Изо", "Литература",}),
    SUBJECT_3(new String[]{"Математика", "Русский язык", "Изо", "Литература", "Иностранный язык"}),
    SUBJECT_4(new String[]{"Математика", "Русский язык", "Изо", "Литература", "Иностранный язык", "Физкультура"}),
    SUBJECT_5(new String[]{"Алгебра", "Геометрия", "Русский язык", "Изо", "Литература", "Иностранный язык", "Физкультура"}),
    SUBJECT_6(new String[]{"Алгебра", "Геометрия", "Русский язык", "Биология", "Литература", "Иностранный язык", "Физкультура", "Химия"}),
    SUBJECT_7(new String[]{"Алгебра", "Геометрия", "Русский язык", "Биология", "Литература", "Иностранный язык", "Физкультура", "Химия", "Черчение"}),
    SUBJECTS_FOR_TEACHERS(new String[]{"Алгебра", "Геометрия", "Русский язык", "Биология", "Литература", "Иностранный язык", "Физкультура", "Химия", "Черчение", "Математика", "Изо"});


    private String[] subjects;
    //не задан  модификатор доступа
    Subject(String[] subjects) {
        this.subjects = subjects;
    }

    public String[] getSubjects() {
        return subjects;
    }
}
