package olga.fedianina.people.base;

public enum Subject {
    SUBJECT_1(new String[]{"Математика", "Русский язык", "Изо", "Литература",}),
    SUBJECT_3(new String[]{"Математика", "Русский язык", "Изо", "Литература", "Иностранный язык"}),
    SUBJECT_4(new String[]{"Математика", "Русский язык", "Изо", "Литература", "Иностранный язык", "Физкультура"}),
    SUBJECT_5(new String[]{"Алгебра", "Геометрия", "Русский язык", "Изо", "Литература", "Иностранный язык", "Физкультура"}),
    SUBJECT_6(new String[]{"Алгебра", "Геометрия", "Русский язык", "Биология", "Литература", "Иностранный язык", "Физкультура", "Химия"}),
    SUBJECT_7(new String[]{"Алгебра", "Геометрия", "Русский язык", "Биология", "Литература", "Иностранный язык", "Физкультура", "Химия", "Черчение"}),
    SUBJECTS_FOR_TEACHERS(new String[]{"Алгебра", "Геометрия", "Русский язык", "Биология", "Литература", "Иностранный язык", "Физкультура", "Химия", "Черчение", "Математика", "Изо"});


    private String[] subjects;

    Subject(String[] subjects) {
        this.subjects = subjects;
    }

    public String[] getSubjects() {
        return subjects;
    }
}
